Repository: crowdagger/crowbook
Catalog: lang/lib/*.po
Languages: fr

source: HTML (standalone page)
fr: HTML (page indépendante)

source: HTML (standalone page/proofreading)
fr: HTML (page indépendante/relecture)

source: HTML (multiple pages)
fr: HTML (plusieurs pages)

source: HTML (multiple pages/proofreading)
fr: HTML (plusieurs pages/relecture)

source: LaTeX (proofreading)
fr: LaTeX (relecture)

source: PDF (proofreading)
fr: PDF (relecture)

source: HTML (interactive fiction)
fr: HTML (fiction interactive)

source: Error initializing book: could not set {key} to {value}: {error}
fr: Erreur à l'initialisation du livre: impossible de positionner {key} à {value} : {error}

source: book
fr: livre

source: could not parse {file} as a book file. Maybe you meant to run crowbook with the --single argument?
fr: impossible d'analyser {file} comme un fichier de livre. Peut-être que vous vouliez lancer crowbook avec l'argument --single ?

source: YAML block was not valid YAML: {error}
fr: Le bloc YAML n'était pas valide : {error}

source: YAML part of the book is not a valid hashmap
fr: La partie YAML du livre n'est pas une hashmap valide

source: chapter filenames must not contain whitespace
fr: les noms de fichier des chapitres ne doivent pas contenir d'espace

source: no chapter name specified
fr: pas de nom de chapitre spécifié

source: setting options
fr: mise en place des options

source: could not read source: {error}
fr: impossible de lire la source : {error}

source: Parsing chapters
fr: Analyse des chapitres

source: Processing...
fr: En cours cours...

source: ill-formatted line specifying chapter number
fr: line spécifiant un numéro de chapitre mal formattée

source: error parsing chapter number: {error}
fr: erreur dans l'analyse du numéro de chapitre: {error}

source: ill-formatted line specifying part number
fr: line spécifiant un numéro de partie mal formattée

source: error parsing part number: {error}
fr: erreur dans l'analyse du numéro de partie : {error}

source: found invalid part definition in the chapter list
fr: définition de partie invalide trouvée dans la liste des chapitres

source: found invalid chapter definition in the chapter list
fr: définition de chapitre invalide trouvée dans la liste des chapitres

source: {error}. Proceeding without using languagetool.
fr: {error}. On poursuit sans utiliser languagetool.

source: {error}. Proceeding without using grammalecte.
fr: {error}. On poursuit sans utiliser grammalecte.

source: Finished
fr: Terminé

source: rendering...
fr: rendu en cours...

source: Error rendering {name}: {error}
fr: Erreur dans le rendu de {name} : {error}

source: Attempting to generate {format}...
fr: Tentative de générer le format {format}...

source: output to {format} set to auto but can't find book file name to infer it
fr: sortie de {format} mise à auto mais impossible de trouver le nom de fichier du livre pour l'inférer

source: the {format} renderer does not support auto for output path
fr: le moteur de rendu pour {format} ne supporte pas auto comme chemin de sortie

source: Succesfully generated {format}: {path}
fr: Format {format} généré avec succès : {path}

source: generated {path}
fr: généré {path}

source: unknown format {format}
fr: format inconnu : {format}

source: generated {format}
fr: {format} généré

source: Succesfully generated {format}
fr: Format '{format}' généré avec succès

source: unknown format
fr: format inconnu

source: Processing {file}...
fr: Analyse de {file} en cours...

source: file {file} contains invalid UTF-8
fr: le fichier {file} contient de l'UTF-8 invalide

source: Parsing...
fr: Analyse en cours...

source: Warning: book contains chapter '{file}' in a directory above the book file, this might cause problems
fr: Avertissement: le livre contient un chapitre '{file}' dans un répertoire au-dessus du fichier du livre, cela risque de causer des problèmes

source: Running languagetool
fr: Languagetool en cours

source: Trying to run languagetool on {file}, this might take a while...
fr: On essaie d'utiliser languagetool sur {file}, cela peut prendre un moment...

source: Error running languagetool on {file}: {error}
fr: Erreur en utilisant languagetool sur {file} : {error}

source: Running grammalecte
fr: Grammalecte en cours

source: Trying to run grammalecte on {file}, this might take a while...
fr: On essaie d'utiliser grammalecte {file}, cela peut prendre un moment...

source: Error running grammalecte on {file}: {error}
fr: Erreur en utilisant grammalecte sur {file} : {error}

source: Detecting repetitions
fr: Détection des répétitions

source: Trying to run repetition detector on {file}, this might take a while...
fr: Détection des répétitions dans {file}, cela peut prendre un moment...

source: Error running repetition detector on {file}: {error}
fr: Erreur dans la détection de répétitions dans {file} : {error}

source: this subchapter contains a heading that, when adjusted, is not in the right range ({} instead of [0-6])
fr: ce sous-chapitre contient un titre qui, après ajustement, n'est pas à un niveau valide ({} au lieu de [0-6])

source: Parsing {file}
fr: Analyse de {file} en cours

source: Parsing chapter: {file}...
fr: Analyse du chapitre: {file}...

source: book chapter
fr: chapitre de livre

source: invalid template '{template}'
fr: template invalide '{template}'

source: file '{file}' could not be read
fr: le fichier '{file}' n'a pas pu être lu

source: can not use roman numerals with zero or negative chapter numbers ({n})
fr: impossible d'utiliser des chiffres romain avec des nombres négatifs ou nuls ({n})

source: header generated by mustache was not valid utf-8
fr: l'en-tête générée par mustache contenait de l'UTF-8 invalide

source: could not render `{key}` for metadata: {error}
fr: impossible de faire le rendu de `{key}` comme metadonnée : {error}

source: Inline YAML block replaced {:?} previously set to {:?} to {:?}
fr: Le bloc YAML en ligne a remplacé {:?} qui était précédemment {:?} vers {:?}

source: Inline YAML block set {:?} to {:?}
fr: Le bloc YAML en ligne a positionné {:?} à {:?}

source: Inline YAML block could not set {:?} to {:?}: {}
fr: Le bloc YAML en ligne n'a pas pu positionner {:?} à {:?} : {}

source: Ignoring YAML block: --- {block}---
fr: Bloc YAML ignoré: --- {block}---

source: Found something that looked like a YAML block: {block}
fr: Trouvé quelque chose qui ressemblait à un bloc YAML : {block}

source: ... but it didn't parse correctly as YAML('{error}'), so treating it like Markdown.
fr: ... mais il n'a pas pu être analysé comme du YAML ('{error}'), on le traite donc comme du Markdown.

source: could not compile '{template}': {error}
fr: impossible de compiler le template '{template}' : {error}

source: could not display fancy UI, try running crowbook with --no-fancy
fr: impossible d'afficher l'interface avancée, essayez de lancer crowbook avec --no-fancy

source: Rendering...
fr: Rendu en cours...

source: waiting...
fr: en attente...

source: This renderer does not support the auto output
fr: Ce moteur de rendu ne supporte pas le format auto

source: could not create file '{file}': {err}
fr: impossible de créer le fichier {file} : {err}

source: could not write book content to file '{file}': {err}
fr: impossible d'écrire le contenu du livre dans le fichier {file} : {err}

source: {:?} is not a string
fr: {:?} n'est pas une chaîne de caractères

source: {:?} is not a string vector
fr: {:?} n'est pas une liste de chaîne de caractères

source: {:?} is not a path
fr: {:?} n'est pas un chemin de fichier

source: {:?} is not a bool
fr: {:?} n'est pas un booléen

source: {:?} is not a char
fr: {:?} n'est pas un caractère

source: {:?} is not an i32
fr: {:?} n'est pas un i32

source: {:?} is not a f32
fr: {:?} n'est pas un f32

source: Metadata
fr: Métadonnée

source: Additional metadata
fr: Métadonnées additionnelles

source: Output options
fr: Options de sortie

source: Specify a list of output formats to render
fr: Spécifie une liste de formats de sortie à générer

source: Rendering options
fr: Options de rendu

source: Special option
fr: Option spéciale

source: HTML options
fr: Options HTML

source: Standalone HTML options
fr: Options pour le HTML autonome

source: Multifile HTML options
fr: Options HTML multi-fichiers

source: Interactive fiction HTML options
fr: Options HTML pour la fiction interactive

source: EPUB options
fr: Options EPUB

source: LaTeX options
fr: Options LaTeX

source: Resources option
fr: Options de ressources

source: Input options
fr: Options d'entrée

source: Crowbook options
fr: Options Crowbook

source: Output options (for proofreading)
fr: Options de sortie (pour la relecture)

source: Proofreading options (only for output.proofread.* targets)
fr: Options de relecture (seulement pour les cibles output.proofread.*)

source: Deprecated options
fr: Options dépréciées

source: Author of the book
fr: Auteur ou autrice du livre

source: Title of the book
fr: Titre du livre

source: Language of the book
fr: Langue du livre

source: Subject of the book (used for EPUB metadata)
fr: Sujet du livre (utilisé pour les métadonnées EPUB)

source: Description of the book (used for EPUB metadata)
fr: Description du livre (utilisé pour les métadonnées EPUB)

source: Path to the cover of the book
fr: Chemin de la couverture du livre

source: Subtitle of the book
fr: Sous-titre du livre

source: License of the book. This information will be displayed on PDF documents
fr: Licence tu livre. Cette information sera affichée dans les documents PDF.

source: Version of the book
fr: Version du livre

source: Date the book was revised
fr: Date de dernière révision du livre

source: An autograph
fr: Un autographe

source: Output file name for EPUB rendering
fr: Nom du fichier EPUB à générer

source: Output file name for HTML rendering
fr: Nom de fichier pour le rendu HTML

source: Output file name for LaTeX rendering
fr: Fichier du format LaTeX à générer

source: Output file name for PDF rendering
fr: Nom de fichier pour le PDF à générer

source: Output file name for ODT rendering
fr: Nom de fichier pour la génération du format ODT

source: Output file name for HTML (interactive fiction) rendering
fr: Nom de fichier pour le rendu HTML (fiction interactive)

source: Output directory name for HTML rendering
fr: Nom de répertoire où générer le HTML

source: Directory where those output files will we written
fr: Répertoire où ces fichiers de sortie seront écrits

source: If/how highligh code blocks. Possible values: "syntect" (default, performed at runtime), "highlight.js" (HTML-only, uses Javascript), "none"
fr: Si et comment faire de la coloration syntaxique des blocs de code. Valeurs possibles :"highlight.js" (uniquement HTML, utilise javascript), "syntect" (effectué lors de l'utilisation de crowbook, valeur par défaut) et "none"

source: Theme for syntax highlighting (if rendering.highlight is set to 'syntect')
fr: Thème pour la coloration syntaxique (si rendering.highlight est placé à 'syntect')

source: Use initials ('lettrines') for first letter of a chapter
fr: Utilise des lettrines pour la première lettre de chaque chapitre

source: Display a table of content in the document
fr: Affiche une table des matières dans le document

source: Name of the table of contents if it is displayed in document
fr: Nom de la table des matières si elle est affichée dans le document

source: The maximum heading levels that should be numbered (0: no numbering, 1: only chapters, ..., 6: all)
fr: Le nombre maximum de niveaux qui devraient être numérotés (0 : aucune numérotation, 1 : seulement les chapitres, ..., 6 : tout)

source: How to call parts (or 'books', 'episodes', ...)
fr: Comment nommer les parties (par exemple 'livres', 'épisodes' ...)

source: How to call chapters
fr: Comment nommer les chapitre

source: Naming scheme of chapters, for TOC
fr: Schéma de nommage des chapitres, pour la table des matières

source: Naming scheme of parts, for TOC
fr: Schéma de nommage des parties, pour la table des matières

source: If set to true, display part number with roman numerals
fr: Si activé, affiche les numéros de partie avec des chiffres romains

source: If set to true, display chapter number with roman numerals
fr: Si activé, affiche les numéros de chapitre avec des chiffres romains

source: If set to true, reset chapter number at each part
fr: Si activé, remet à zéro les numéros de chapitre à chaque partie

source: Import another book configuration file
fr: Importe un autre fichier de configuration de livre

source: Path to an icon to be used for the HTML files(s)
fr: Chemin vers une icone à utiliser pour le(s) fichier(s) HTML

source: Custom header to display at the beginning of html file(s)
fr: En-tête personnalisée à afficher au début de chaque fichier HTML

source: Custom footer to display at the end of HTML file(s)
fr: Pied de page personnalisé à afficher à la fin des fichiers HTML

source: Path of a stylesheet for HTML rendering
fr: Chemin d'une feuille de style pour le rendu HTML

source: Some inline CSS added to the stylesheet template
fr: Du code CSS en ligne à ajouter au template de la feuille de style

source: Path of a stylesheet for the colors for HTML
fr: Chemin d'une feuille de style pour les couleurs pour le HTML

source: Path of a javascript file
fr: Chemin d'un fichier javascript

source: Path of a media print stylesheet for HTML rendering
fr: Chemin d'une feuille de style pour l'impression, pour le rendu HTML

source: Set another highlight.js version than the bundled one
fr: Donne une autre version de highlight.js que celle qui est embarquée

source: Set another highlight.js CSS theme than the default one
fr: Donne un autre thème CSS highlight.js à utilise que celui par défaut

source: Display footnotes as side notes in HTML/Epub (experimental)
fr: Affiche les notes de bas de pages sur le côté pour le HTML/EPUB (expérimental)

source: Replace unicode non breaking spaces with HTML entities and CSS
fr: Remplace les espaces insécables unicode par des entités HTML et du CSS

source: Display only one chapter at a time (with a button to display all)
fr: N'affiche qu'un seul chapitre à la fois (avec un bouton pour les afficher tous)

source: Path of an HTML template for standalone HTML
fr: Chemin d'un template HTML pour le fichier HTML indépendant

source: Javascript code that will be run at the beginning of each segment
fr: Code Javascript qui sera exécuté au début de chaque segment

source: Javascript code that will be run at the end of each segment
fr: Code Javascript qui sera exécuté à la fin de chaque segment

source: Javascript code that will be run at the beginning of a 'game'
fr: Code javascript qui sera exécuté au début d'un 'jeu'

source: Inline template for HTML chapter formatting
fr: Template en ligne pour le formatage HTML des titres de chapitre

source: Inline template for HTML part formatting
fr: Template en ligne pour le formatage HTML des titres de parties

source: Path of a HTML template for multifile HTML
fr: Chemin d'un template HTML pour le HTML multi-fichiers

source: EPUB version to generate (2 or 3)
fr: Version du format EPUB à générér (2 ou 3)

source: Path of a stylesheet for EPUB
fr: Chemin d'une feuille de style pour le fichier EPUB

source: Inline CSS added to the EPUB stylesheet template
fr: Code CSS en ligne à ajouter au template de la feuille de style EPUB

source: Path of an xhtml template for each chapter
fr: Chemin d'um template XHTML pour chaque chapitre

source: Add 'Title' and (if set) 'Cover' in the EPUB table of contents
fr: Ajoute 'Titre' et 'Couverture' (s'il y en a une) dans la table des matières EPUB

source: Add foontotes to URL of links so they are readable when printed
fr: Ajoute des notes de bas de page à l'URL des liens pour qu'elle soit lisible à l'impression

source: LaTeX command to use for generating PDF
fr: Commande LaTeX utilisée pour générer le PDF

source: Path of a LaTeX template file
fr: Chemin d'un fichier template LaTeX

source: Inline code added in the LaTeX template
fr: Code en ligne à ajouter au template LaTeX

source: LaTeX class to use
fr: Classe LaTeX à utiliser

source: If true, generate a title with \maketitle
fr: Si activé, génère un titre avec la commande \maketitle

source: Specifies the size of the page.
fr: Spécifie la taille de la page

source: Specifies left margin (note that with book class left and right margins are reversed for odd pages, thus the default value is 1.5cm for book class and 2cm else)
fr: Spécifie la marge gauche (notez qu'avec la classe 'book' les marges de gauche et de droite sont inversées pour les pages paires, par conséquent la valeur par défaut est 1.5cm pour la classe book et 2cm sinon)

source: Specifies right margin(note that with book class left and right margins are reversed for odd pages, thus the default value is 2.5cm for book class and 2cm else)
fr: Spécifie la marge droite (notez qu'avec la classe 'book' les marges de gauche et de droite sont inversées pour les pages paires, par conséquent la valeur par défaut est 2.5cm pour la classe book et 2cm sinon)

source: Specifies top margin
fr: Spécifie la marge supérieure

source: Specifies left margin
fr: Spécifie la marge inférieure

source: Specify latex font size (in pt, 10 (default), 11, or 12 are accepted)
fr: Spécifie la taille de la police (en pt, 10 (par défaut), 11 ou 12 sont acceptés)

source: If disabled, don't try to find references inside the document
fr: Si désactivé, n'essaie pas de trouver des références dans le document

source: If set to true, use 'stdpage' package to format a manuscript according to standards
fr: Si activé, utilise le package 'stdpage' pour formater le manuscrit seloncerrtains standards

source: Whitespace-separated list of files to embed in e.g. EPUB file; useful for including e.g. fonts
fr: Liste de fichiers, séparés par des espaces, à embarquer par exemple dans un fichier EPUB ; utile pour inclure des fontes.

source: Paths where additional resources should be copied in the EPUB file or HTML directory
fr: Chemins où les ressources additionnelles devraient être copiées dans le fichier EPUB ou dans le répertoire HTML

source: Path where to find resources (in the source tree). By default, links and images are relative to the Markdown file. If this is set, it will be to this path.
fr: Chemin où trouver les ressources. Par défaut, les liens et les images sont relatifs au fichier Markdown. Avec cette option, ce sera relatif à ce chemin.

source: Set base path but only for links. Useless if resources.base_path is set
fr: Donne un chemin de base mais seulement pour les liens. Inutile si resources.base_path est réglé

source: Set base path but only for images. Useless if resources.base_path is set
fr: Donne un chemin de base mais seulement pour les images. Inutile si resources.base_path est réglé

source: Set base path but only for additional files. Useless if resources.base_path is set.
fr: Donne un chemin de base mais seulement pour les fichiers additionnels. Inutile si resources.base_path est déjà réglé.

source: Set base path but only for templates files. Useless if resources.base_path is set
fr: Règle le chemin de base mais seulement pour les fichiers templates. Inutile si resources.base_path est réglé

source: Toggle typographic cleaning of input markdown according to lang
fr: Active le nettoyage du Markdown en entrée en fonction de la langue

source: If enabled, tries to replace vertical quotations marks to curly ones
fr: Si activé, essaie de remplacer les apostrophes et guillemets droits par des apostrophes et guillemets typographiques

source: If enabled, replaces '--' to en dash ('–') and '---' to em dash ('—')
fr: Si activé, remplace '--' par un tiret demi-cadratin ('–') et '---' par un tiret cadratin ('—')

source: If enabled, replaces '<<' and '>>' to french "guillemets" ('«' and '»')
fr: Si activé, remplace '<<' et '>>' par des guillemets français ('«' et '»')

source: If enabled, allow support for superscript and subscript using respectively foo^up^ and bar~down~ syntax.
fr: Si activé, permet le support pour l'exposant et l'indice en utilisant respectivement la syntaxe foo^haut^ et bar~bas~.

source: Enable inline YAML blocks to override options set in config file
fr: Permet aux blocs YAML en ligne de rédéfinir des options déjà définies par le fichier de configuration

source: Consider HTML blocks as text. This avoids having <foo> being considered as HTML and thus ignored.
fr: Considère les blocs HTML comme du texte. Cela évite d'avoir <foo> considéré comme du HTML et donc ignoré.

source: Consider that a new file is always a new chapter, even if it does not include heading (default: only for numbered chapters)
fr: Considère qu'un nouveau fichier est toujours un nouveau chapitre, même lorsqu'il n'inclut pas de titre (défaut : seulement pour les chapitres numérotés)

source: Path where to create a temporary directory (default: uses result from Rust's std::env::temp_dir())
fr: Chemin où créer un répertoire temporaire (par défaut, utilise le résultat de la fonction Rust std::env::temp_dir())

source: Command to use to zip files (for EPUB/ODT)
fr: Commande à lancer pour zipper des fichiers (pour EPUB/ODT)

source: Output file name for HTML rendering with proofread features
fr: Ficher de sortie où générer le HTML avec options de relecture

source: Output directory name for HTML rendering with proofread features
fr: Nom d'un répertoire où générer le HTML pour la relecture

source: Output file name for PDF rendering with proofread features
fr: Nom de fichier pour le PDF à générer avec options de relecture

source: If set to false, will disactivate proofreading even if one of output.proofread.x is present
fr: Si mis à faux, désactivera la génération de fichiers de relecture même si une des cibles output.proofread.x est présente

source: If true, try to use language tool server to grammar check the book
fr: Si mis à vrai, essaie d'utiliser le serveur languagetool pour effectuer une correction grammaticale du livre

source: Port to connect to languagetool-server
fr: Port sur lequel se connecter à languagetool-server

source: If true, try to use grammalecte server to grammar check the book
fr: Si mis à vrai, essaie d'utiliser le serveur grammalecte pour effectuer une correction grammaticale du livre

source: Port to connect to grammalecte server
fr: Port sur lequel se connecter au serveur grammalecte

source: If set to true, use Caribon to detect repetitions
fr: Si mis à vrai, utilise Caribon pour détecter les répétitions

source: Max distance between two occurences so it is considered a repetition
fr: Distance maximale entre deux occurrences d'un mot pour considérer qu'il s'agit d'une répétition

source: Enable fuzzy string matching
fr: Active la correspondance approximative des chaînes de caractère

source: Max threshold of differences to consider two strings a repetition
fr: Seuil maximal de différence pour considérer deux mots comme une répétition

source: Ignore proper nouns for repetitions
fr: Ignore les noms propres pour les répétitions

source: Threshold to detect a repetition
fr: Seuil pour détecter une répétition

source: If set, set theme for syntax highlighting for LaTeX/PDF output (syntect only)
fr: Si activé, sélectionne le thème pour la coloration syntaxique pour la sortie LaTeX/PDF (syntect uniquement)

source: If set, set theme for syntax highlighting for HTML output (syntect only)
fr: Si activé, sélectionne le thème pour la coloration syntaxique pour la sortie HTML (syntect uniquement)

source: If set, set theme for syntax highlighting for EPUB output (syntect only)
fr: Si activé, sélectionne le thème pour la coloration syntaxique pour la sortie EPUB (syntect uniquement)

source: Renamed
fr: Renommé

source: Removed
fr: Supprimé

source: Ill-formatted OPTIONS string: unrecognized type '{option_type}'
fr: Chaîne OPTIONS mal formatée : type non reconnu '{option_type}'
