Repository: crowdagger/crowbook
Catalog: lang/lib/*.po
Languages: fr

source: Expected a String as a key, found {:?}
fr: Une String était attendue comme clé, pas {:?}

source: Expected only string in the list for key {}, found {:?}
fr: Seules des chaînes de caractères étaient attendues dans la liste pour la clé {}, pas {:?}

source: The output format {format} for key {key} is not recognized
fr: Le format {format} pour la clé {key} n'est pas reconnu

source: Expected a list as value for key {}, found {:?}
fr: Une liste était attendue pour la clé {}, pas {:?}

source: Expected a string as value for key {}, found {:?}
fr: Une chaîne de caractères était attendue pour la clé {}, pas {:?}

source: '{value}''s path contains invalid UTF-8 code
fr: le chemin de '{value}' contient de l'UTF-8 invalide

source: expected a string as value for key '{}', found {:?}
fr: une chaîne de caractères était attendue comme valeur pour la clé '{}', pas {:?}

source: could not parse '{value}' as a char: does not contain exactly one char
fr: impossible d'analyser '{value}' comme un caractère : ne contient pas exactement un caractère

source: expected a string as value containing a char for key '{}', found {:?}
fr: une chaîne de caractère contenant un caractère comme valeur pour la clé '{}', pas {:?}

source: expected a boolean as value for key '{}', found {:?}
fr: un booléen était attendue comme valeur pour la clé '{}', pas {:?}

source: expected an integer as value for key '{}', found {:?}
fr: un entier était attendu comme valeur pour la clé '{}', pas {:?}

source: could not parse '{value}' as a float for key '{key}'
fr: impossible d'analyser '{value}' comme un flottant pour la clé '{key}'

source: expected a float as value for key '{}', found {:?}
fr: un flottant était attendu comme valeur pour la clé '{}', pas {:?}

source: '{old_key}' has been deprecated, you should now use '{new_key}'
fr: '{old_key}' a été déprécié, vous devriez maintenant utiliser '{new_key}'

source: key '{key}' has been deprecated.
fr: la clé '{key}' a été dépréciée

source: unrecognized key '{key}'
fr: clé '{key}' non reconnue

source: value '{value}' for key '{key}' does not contain one and only one YAML value
fr: la valeur '{value}' pour la clé '{key}' ne contient pas une et une seule valeur YAML

source: could not parse '{value}' as a valid YAML value
fr: impossible d'analyser '{value}' comme une valeur YAML valide

source: option '{key}' is not present
fr: l'option '{key}' n'est pas présente

source: '{key}''s path contains invalid UTF-8 code
fr: le chemin de '{key}' contient de l'UTF-8 invalide

source: could not get current directory!
fr: impossible d'obtenir le répertoire courant !

source: boolean
fr: booléen

source: float
fr: flottant

source: integer
fr: entier

source: char
fr: caractère

source: string
fr: chaîne de caractères

source: path
fr: chemin

source: template path
fr: chemin d'un template

source: metadata
fr: métadonnée

source: list of strings
fr: liste de chaînes de caractères

source: DEPRECATED
fr: DÉPRÉCIÉ

source: not set
fr: non défini

source: - **`{key}`** - **type**: {option_type} - **default value**: `{default}` - {comment}
fr: - **`{key}`** - **type** : {option_type} - **valeur par défaut** : `{default}` - {comment}

source: default:
fr: défaut :

source: Could not run zip command, falling back to zip library
fr: Impossible de lancer la commande zip, utilisation de la bibliothèque zip à la place

source: image or cover
fr: image ou couverture

source: additional resource from resources.files
fr: ressource additionnelle de resources.files

source: cover
fr: couverture

source: generated HTML for cover.xhtml was not utf-8 valid
fr: le HTML généré pour cover.xhtml contient de l'UTF-8 invalide

source: Why is this method called if cover is None???
fr: Pourquoi cette méthode est-elle appelée si la couverture est None???

source: generated HTML was not utf-8 valid
fr: le HTML contient de l'UTF-8 invalide

source: EPUB ({source}): detected two chapter titles inside the same markdown file, in a file where chapter titles are not even rendered.
fr: EPUB ({source}): deux titres de chapitre détectés à l'intérieur du même fichier Markdown, dans un fichier où les titres de chapitres ne sont même pas affichés.

source: EPUB ({source}): detected two chapters inside the same markdown file.
fr: EPUB ({source}) : deux chapitres détectés à l'intérieur du même fichier Markdown.

source: EPUB ({source}): conflict between: {title1} and {title2}
fr: EPUB ({source}) : conflit entre {title1} et {title2}

source: EPUB: could not guess the format of {file} based on extension. Assuming png.
fr: EPUB: impossible de deviner le format de {file} à partir de son extension. On part sur du png.

source: empty str token, could not find initial
fr: jeton str vide, impossible de trouver la lettrine

source: Error while trying to check grammar: {error}
fr: Erreur en essayant de vérifier la grammaire : {error}

source: Error parsing markdown: {error}
fr: Erreur dans l'analyse du Markdown : {error}

source: Error parsing configuration file:
fr: Erreur dans l'analyse du fichier de configuration :

source: Could not find file '{file}' for {description}
fr: Impossible de trouver le fichier '{file}' pour {description}

source: Error compiling template: {template}
fr: Erreur dans la compilation du template : {template}

source: Error during rendering:
fr: Erreur dans le rendu :

source: Error during temporary files editing:
fr: Erreur durant l'édition de fichiers temporaires :

source: Error converting BookOption:
fr: Erreur en convertissant BookOption :

source: Error accessing book option:
fr: Erreur en accèdant à l'option :

source: error during EPUB generation: {error}
fr: Erreur dans la génération de l'EPUB: {error}

source: UTF-8 error: {error}
fr: Erreur UTF-8 : {error}

source: format error: {error}
fr: error de formatage : {error}

source: grammalecte only works with 'fr' lang
fr: grammalecte ne marche qu'avec la langue 'fr'

source: could not connect to grammalecte server: {error}
fr: impossible de se connecter au serveur grammalecte : {error}

source: server didn't respond with a OK status code
fr: le serveur n'a pas répondu avec un code de statut OK

source: could not send request to server: {error}
fr: impossible d'envoyer la requête au serveur : {error}

source: could not read response: {error}
fr: impossible de lire la réponse : {error}

source: could not decode JSON: {error}
fr: impossible de créer le format JSON : {error}

source: some error messages from Grammalecte were ignored because of format
fr: des messages d'erreur de Grammalecte ont été ignorées à cause du format

source: could not connect to language tool server: {error}
fr: impossible de se connecter au serveur languagetool : {error}

source: rendering.highlight set to '{}', not a valid value
fr: rendering.highlight a une valeur de '{}' qui n'est pas valide

source: rendering 'html.footer' template: {error}
fr: dans le rendu du template 'html.footer' : {error}

source: rendering 'html.header' template: {error}
fr: dans le rendu du template 'html.header' : {error}

source: {path} already exists and is not a directory
fr: {path} existe déjà et n'est pas un répertoire

source: {path} already exists, deleting it
fr: {path} existe déjà, il sera supprimé

source: error deleting directory {path}: {error}
fr: erreur dans la suppression du répertoire {path} : {error}

source: could not create HTML directory {path}: {error}
fr: impossible de créer le répertoire HTML {path} : {error}

source: error while reading image file {file}: {error}
fr: erreur en lisant le fichier image {file} : {error}

source: error while reading resource file: {error}
fr: erreur en lisant le fichier ressource : {error}

source: could not create directory in {path}: {error}
fr: impossible de créer un répertoire dans {path} : {error}

source: could not create file {file}: {error}
fr: impossible de créer le fichier {file} : {error}

source: could not write to file {file}: {error}
fr: impossible d'écrire dans le fichier {file} : {error}

source: can only render HTML directory to a path, not to a stream
fr: erreur : le répertoire HTML ne peut être rendu que vers un chemin, pas un flux

source: problem when writing interactive fiction: {error}
fr: problème en écrivant la fiction interactive : {error}

source: problem when writing HTML: {error}
fr: problème en écrivant dans le fichier HTML : {error}

source: Yaml file for language {lang} didn't contain a hash
fr: Le fichier YAML pour le langage {lang} no contient pas de hashmap

source: Could not find translation for {key} in language {lang}
fr: Impossible de trouver une traduction pour {key} dans la langue {lang}

source: Yaml for {key} in lang {lang} is not a String!
fr: Le Yaml pour {key} dans la langue {lang} n'est pas une chaîne de caractères !

source: Attempting to run LaTeX on generated file
fr: En train d'essayer de lancer LaTeX sur le fichier généré

source: error while reading image file: {error}
fr: erreur en lisant le fichier image : {error}

source: LaTeX: can't find a tex equivalent for lang '{lang}', fallbacking on english
fr: LaTeX: impossible de trouver un équivalent tex pour la langue '{lang}', utilisation de l'anglais par défaut

source: generated LaTeX was not valid utf-8
fr: le fichier LaTeX généré contenait de l'UTF-8 invalide

source: found {n} indented ordered lists, LaTeX only allows for 4
fr: liste ordonnée imbriqué à {n} niveau, LaTeX n'en permet que 4

source: LaTeX ({source}): image '{url}' doesn't seem to be local; ignoring it.
fr: LaTeX ({source}) : l'image '{url}' n'a pas l'air d'être locale, elle sera ignorée

source: problem when writing LaTeX: {error}
fr: problème en écrivant dans le fichier LaTeX : {error}

source: blockquotes
fr: blocs de citations

source: codeblocks
fr: blocs de code

source: ordered lists
fr: listes ordonnées

source: footnotes
fr: notes de bas de page

source: tables
fr: tableaux

source: superscript
fr: exposant

source: subscript
fr: indice

source: ODT: The document uses the following features, that are not implemented for ODT output: {features}. They will be ignored in the generated document.
fr: ODT : Le document utilise les fonctionnalités suivantes qui ne sont pas implementées pour le rendu ODT : {features}. Elles seront ignorées dans le document généré.

source: Parts are not supported yet in ODT
fr: Les parties ne sont pas encore supportées en ODT

source: generated content.xml was not utf-8 valid
fr: le fichier content.xml généré contenait de l'UTF-8 invalide

source: ODT: Description list and strikethrough not handled in this output
fr: ODT: description list et strikethrough ne sont pas gérés pour cette sortie

source: markdown file
fr: fichier Markdown

source: file {file} contains invalid UTF-8, could not parse it
fr: le fichier {file} contient de l'UTF-8 invalide, impossible de l'analyser

source: Codeblock contains invalid UTF-8
fr: Le bloc de code contient des caractères UTF-8 invalides

source: HTML block contains invalid UTF-8
fr: Le bloc HTML contient de l'UTF-8 invalide

source: ignoring HTML block '{}'
fr: bloc HTML ignoré '{}'

source: Footnote definition contains invalid UTF-8
fr: Définition de note de bas de page contenant de l'UTF-8 invalide

source: Markdown file contains invalid UTF-8
fr: Fichier markdown contenant de l'UTF-8 invalide

source: Link URL contains invalid UTF-8
fr: L'adresse URL contient de l'UTF-8 invalide

source: Link title contains invalid UTF-8
fr: le titre du lien contient de l'UTF-8 invalide

source: Image URL contains invalid UTF-8
fr: L'URL de l'image contient de l'UTF-8 invalide

source: Image title contains invalid UTF-8
fr: Le titre de l'image contient de l'UTF-8 invalide

source: Footnote reference contains invalid UTF-8
fr: La référence de note de bas de page contient de l'UTF-8 invalide

source: could not create caribon parser: {error}
fr: impossible de créer l'analyseur caribon : {error}

source: error detecting repetitions: {err}
fr: erreur dans la détection de répétitions : {err}

source: Resources: book includes non-local image {file}, which might cause problem for proper inclusion.
fr: Ressources : le livre inclut l'image non-locale {file}, ce qui risque de causer des problèmes pour une inclusion correcte

source: Resources: book includes image {file} which doesn't have an extension
fr: Resources: le livre inclut l'image {file} qui n'a pas d'extension

source: Resources: could not read file {file}
fr: Ressources : impossible de lire le fichier {file}

source: Resources: could not guess mime type of file {file}
fr: Ressources : impossible de deviner le type mime du fichier {file}

source: Resources: could not find an in-book match for link {file}
fr: Ressources: impossible de trouver une correspondance à l'intérieur du livre pour le lien {file}

source: error reading file {file}: {error}
fr: Erreur en lisant le fichier {file} : {error}

source: error in epub rendering: {path} is neither a file nor a directory
fr: erreur dans le rendu EPUB : {path} n'est ni un fichier ni un répertoire

source: This version of crowboook has been compiled without support for advanced statistics
fr: Cette version de Crowbook a été compilée sans support pour les statistiques avancées

source: For more advanced statistics, use the --verbose or -v option
fr: Pour des statistiques plus poussées, utilisez l'option --verbose ou -v

source: Chapter
fr: Chapitre

source: Chars
fr: Signes

source: Syllables
fr: Syllabes

source: Words
fr: Mots

source: Sentences
fr: Phrases

source: Chars/Word
fr: Signes/mot

source: Words/Sentence
fr: Mots/phrase

source: Flesch reading ease index
fr: Index de Flesch

source: could not set syntect theme to {theme}, defaulting to "InspiredGitHub"
fr: impossible de placer le thème à {theme}, on se rabat sur "InspiredGitHub"

source: valid theme names are: {themes}
fr: les noms de thèmes valides sont : {themes}

source: crowbook was compiled without syntect support, syntax highlighting will be disabled
fr: cette version de crowbook a été compilée sans support de syntect, la coloration syntaxique sera désactivée

source: ignored annotation {:?} as it wasn't compatible with the Markdown structure
fr: annotation {:?} ignorée car non compatible avec la structure Markdown

source: could not create temporary directory in {path}
fr: impossible de créer le répertoire temporaire dans {path}'

source: file {file} refers to an absolute or a parent path. This is forbidden because we are supposed to create a temporary file in a temporary dir.
fr: le fichier {file} fait référence à un chemin parent ou absolu. C'est interdit car on est censé créer un fichier temporaire dans un répertoire temporaire.

source: could not write to temporary file {file}
fr: impossible d'écrire dans le fichier temporaire {file}

source: could not create temporary file {file}
fr: impossible de créer le fichier temporaire {file}

source: failed to execute unzip on {file}: {error}
fr: impossible d'exécuter unzip sur {file} : {error}

source: failed to remove file {file}
fr: Impossible de supprimer le fichier '{file}'

source: output for command {name}: {error}
fr: sortie pour la commande {name}: {error}

source: failed to run command '{name}'
fr: impossible d'exécuter la commande '{name}'

source: could not open result of command '{command}' Command output: {output}'
fr: impossible de lire le résultat de la commande '{command}' Sortie de la commande : {output}

source: could not open result of command '{command}'
fr: impossible de lire le résultat de la commande '{command}'

source: error copying file '{file}'
fr: Erreur en copiant le fichier '{file}'

source: {command} didn't return succesfully: {output}
fr: {command} ne ne s'est pas terminé avec succès : {output}

source: {command} didn't return succesfully
fr: {command} ne s'est pas terminé avec succès
